package com.zoley.common.result;

import lombok.Getter;

/**
 * 类 名: ResultCode
 * 描 述:
 * 作 者: 主成睿
 * 创 建：2026年06月29日
 * 版 本：v1.0.0
 * <p>
 * 历 史: (版本) 作者 时间 注释
 */
@Getter
public enum ResultCode {
  // 通用状态码（扩展通用状态码使用4位整数）
  CODE_200(200,"请求成功"),

  CODE_201(201, "请求成功并且服务器创建了新的资源"),

  CODE_204(204, "请求成功，但没有返回任何内容"),

  CODE_301(301, "请求的网页已永久移动到新位置"),

  CODE_302(302, "服务器目前从不同的位置响应请求"),

  CODE_400(400, "服务器不理解请求的语法"),

  CODE_401(401 ,  "Token认证失败或过期"),

  CODE_402(402,"认证信息为空"),

  CODE_403(403, "无权限, 服务器拒绝请求"),

  CODE_404(404, "服务器找不到请求的资源"),

  CODE_408(408, "请求超时"),

  CODE_422(422,"参数异常"),

  CODE_429(429,"请求次数过多"),

  CODE_430(430,"请求方法类型不支持"),

  CODE_431(431,"请求参数类型不支持"),

  CODE_432(432,"请求体为空"),

  CODE_433(433,"鉴权异常"),

  CODE_434(434,"决策表异常"),

  CODE_435(435,"执行异常"),

  CODE_436(436,"流程执行异常"),

  CODE_437(437,"SQL语句执行异常"),

  CODE_438(438,"自定义表达式执行异常"),

  CODE_439(439,"流程发起提交异常"),

  CODE_500(500,"服务器遇到错误，无法完成请求"),

  CODE_501(501, "服务器不具备完成请求的功能"),

  CODE_502(502, "服务器作为网关或代理，从上游服务器收到无效响应"),

  CODE_503(503, "服务器目前无法使用"),

  CODE_504(504, "网关超时"),

  CODE_505(505, "服务器不支持请求中所用的 HTTP 协议版本"),

  CODE_1001(1001, "查询数据出现异常"),

  CODE_1002(1002, "修改数据出现异常"),

  CODE_1003(1003, "添加数据出现异常"),

  CODE_1004(1004, "删除数据出现异常"),

  CODE_1011(1011, "名称不能为空"),

  CODE_1012(1012, "编码不能为空"),

  CODE_1014(1014, "编码已存在"),

  CODE_4001(4001, "token已过期"),

  CODE_4002(4002, "token需要刷新"),

  CODE_4003(4003, "token无效"),

  CODE_4004(4004, "许可证信息不存在"),

  CODE_4005(4005, "许可证已过期"),

  CODE_4006(4006, "用户数量已达最大限制数量，无法添加"),

  CODE_4010(4010, "CAS登录认证失败"),

  CODE_4011(4011, "CAS用户不存在或着不允许访问当前系统"),

  CODE_4101(4101, "幂等Key缺失"),

  CODE_4102(4102, "请勿重复提交"),

  CODE_4104(4104, "数据源信息存在异常无法连接"),

  CODE_4105(4105, "找不到groovy语言执行引擎"),

  CODE_4106(4106, "验证码错误"),

  CODE_4107(4107, "验证码不能为空"),

  CODE_4108(4108, "验证码已过期，请刷新重试"),

  CODE_4109(4109, "loginSessionId为空"),

  CODE_4110(4110, "密码强度弱，强度要求：9位以上，包含大小写字母、数字、特殊字符"),

  CODE_4111(4111, "表达式执行异常"),

  // 应用状态码（统一使用5位整数）
  CODE_10011(10011, "分类code不能为空"),

  CODE_10012(10012, "流程定义schema数据为空"),

  CODE_10014(10014, "分类code数据已存在"),

  CODE_10015(10015, "对应流程定义不存在"),

  CODE_10016(10016, "对应流程实例不存在"),

  CODE_10023(10023, "选中数据不存在，请刷新重试"),

  CODE_10025(10025, "添加操作日志信息出现日常"),

  CODE_10026(10026, "对应表单定义不存在"),

  CODE_10027(10027, "链接已存在"),

  CODE_10033(10033, "配置值不能为空"),

  CODE_10043(10043, "类型不能为空"),

  CODE_10044(10044, "角色ID不能为空"),

  CODE_10045(10045, "组ID不能为空"),

  CODE_10046(10046, "请判断是否添加关联"),

  CODE_10047(10047, "添加关联失败，关联关系已存在"),

  CODE_10048(10048, "添加关联失败出现异常"),

  CODE_10049(10049, "被包含角色id不能为空"),

  CODE_10050(10050, "添加关联失败，角色包含存在循环关系"),

  CODE_10051(10051, "用户ID不能为空"),

  CODE_10052(10052, "重置密码出现异常"),

  CODE_10053(10053, "角色编码不能重复"),

  CODE_10054(10054, "组编码不能重复"),

  CODE_10055(10055, "两次密码输入不同，请检查"),

  CODE_10056(10056, "登录成功"),

  CODE_10057(10057, "用户不存在！"),

  CODE_10058(10058, "用户名或密码错误！"),

  CODE_10059(10059, "认证失败，请联系管理员！"),

  CODE_10060(10060, "用户锁定或解锁出现异常"),

  CODE_10061(10061, "修改排序出现异常"),

  CODE_10062(10062, "存在下级数据，无法删除"),

  CODE_10063(10063, "账号已被锁定！"),

  CODE_10071(10071, "添加用户信息出现异常"),

  CODE_10072(10072, "修改用户信息出现异常"),

  CODE_10073(10073, "账号重复，新增用户失败"),

  CODE_10074(10074, "删除用户信息出现异常"),

  CODE_10075(10075, "存在下级岗位，无法删除"),

  CODE_10076(10076, "存在下级组织单元，删除失败"),

  CODE_10077(10077, "删除组织维度信息出现异常"),

  CODE_10078(10078, "岗位下存在主岗成员，无法删除"),

  CODE_10079(10079, "岗位下存在兼岗成员，无法删除"),

  CODE_10081(10081, "组织名称不能为空"),

  CODE_10080(10080, "上级维度为空"),

  CODE_10082(10082, "组织编码不能为空"),

  CODE_10083(10083, "组织类型不能为空"),

  CODE_10084(10084, "公司下属维度范围内组织编码存在重复"),

  CODE_10085(10085, "岗位名称不能为空"),

  CODE_10086(10086, "所属组织不能为空"),

  CODE_10089(10089, "流程标识已存在"),

  CODE_10090(10090, "流程定义已部署，无法修改编码"),

  CODE_10091(10091, "部署流程定义出现异常"),

  CODE_10092(10092, "流程定义未找到，请刷新重试"),

  CODE_10093(10093, "该流程定义已部署，请刷新重试"),

  CODE_10094(10094, "流程定义key不能为空"),

  CODE_10095(10095, "流程定义key不能重复"),

  CODE_10096(10096, "解析json数据出现异常"),

  CODE_10097(10097, "创建BPMN模型实例出现异常"),

  CODE_10098(10098, "流程定义已部署，无法删除"),

  CODE_10099(10099, "流程定义已部署，流程标识不能修改"),

  CODE_10100(10100, "流程定义JsonSchema数据校验出现异常"),

  CODE_10101(10101, "流程定义未部署"),

  CODE_10102(10102, "用户任务未配置办理人，请维护后重新操作"),

  CODE_10110(10110, "数据源配置信息不能为空"),

  CODE_10111(10111, "连接url不能为空"),

  CODE_10112(10112, "数据源账号密码不能为空"),

  CODE_10113(10113, "SQL语句查询存在异常，请检查"),

  CODE_10114(10114, "数据源连接出现异常"),

  CODE_10115(10115, "请指定数据源信息"),

  CODE_10116(10116, "指定的数据源信息已不存在"),

  CODE_10117(10117, "指定的数据源信息未启用"),

  CODE_10118(10118, "执行的sql语句不能为空"),

  CODE_10119(10119, "sql语句包含敏感操作"),

  CODE_10120(10120, "请指定数据库"),

  CODE_10121(10121, "数据集信息已不存在"),

  CODE_10122(10122, "查询数据源结构树出现异常"),

  CODE_10123(10123, "当前操作用户不为任务执行人，无法完成任务"),

  CODE_10124(10124, "任务实例已不存在，请确认重试!"),

  CODE_10125(10125, "操作人信息为空，请刷新重试!"),

  CODE_10126(10126, "对应表单实例数据已不存在"),

  CODE_10127(10127, "SQL语句运行出现异常"),

  CODE_10128(10128, "请选择需要操作的节点"),

  CODE_10129(10129, "流程实例已完成，无法执行操作"),

  CODE_10130(10130, "当前操作人无知会数据，无法提交知会"),

  CODE_10131(10131, "流转意见不能为空"),

  CODE_10132(10132, "任务已不存在，请刷新重试"),

  CODE_10133(10133, "请选择需要操作人员"),

  CODE_10134(10134, "操作表单实例数据出现异常"),

  CODE_10135(10135, "终止流程出现异常"),

  CODE_10136(10136, "终止流程失败：不存在正在执行的流程实例"),

  CODE_10137(10137, "获取连接数据源信息出现异常"),

  CODE_10138(10138, "数据源已被数据集绑定，无法执行该操作"),

  CODE_10139(10139, "报表配置信息已不存在"),

  CODE_10140(10140, "查询总行数出现异常"),

  CODE_10141(10141, "业务对象信息已不存在"),

  CODE_10142(10142, "当前数据修订版本异常，请刷新重试"),

  CODE_10143(10143, "属性名称或者类型不能为空"),

  CODE_10144(10144, "同一个对象属性名称不能重复"),

  CODE_10145(10145, "业务对象已部署"),

  CODE_10146(10146, "业务对象已删除"),

  CODE_10147(10147, "业务对象属性数据已不存在"),

  CODE_10148(10148, "业务对象属性需要是待部署状态"),

  CODE_10149(10149, "单次部署的业务对象属性需要属于同一业务对象"),

  CODE_10150(10150, "业务对象属性已部署"),

  CODE_10151(10151, "业务对象属性已删除"),

  CODE_10152(10152, "修改排序出现异常"),

  CODE_10153(10153, "业务对象未部署"),

  CODE_10154(10154, "关联表单实例数据为空"),

  CODE_10155(10155, "修改部署状态出现异常"),

  CODE_10156(10156, "修改属性出现异常"),

  CODE_10157(10157, "报表搜索列配置信息为空，无法条件查询"),

  CODE_10158(10158, "保存业务对象实例数据出现异常"),

  CODE_10159(10159, "生成表名或字段名出现异常"),

  CODE_10160(10160, "角色菜单为空"),

  CODE_10161(10161, "父级业务对象信息已删除"),

  CODE_10162(10162, "父级业务对象信息未部署"),

  CODE_10163(10163, "终止消息没有对应的捕获中间事件"),

  CODE_10164(10164, "业务对象实例信息已不存在"),

  CODE_10170(10170, "业务对象不存在"),

  CODE_10171(10171, "新增业务扩展配置出现异常"),

  CODE_10172(10172, "更新业务扩展配置出现异常"),

  CODE_10173(10173, "删除业务扩展配置出现异常"),

  CODE_10174(10174, "关联资源类型不能为空"),

  CODE_10175(10175, "资源操作标识不能为空"),

  CODE_10176(10176, "数据已不存在"),

  CODE_10177(10177, "cron表达式不正确"),

  CODE_10178(10178, "任务名称不能为空"),

  CODE_10179(10179, "任务编码不能为空"),

  CODE_10180(10180, "任务编码已存在"),

  CODE_10181(10181, "对应资源类型不存在"),

  CODE_10182(10182, "资源类型无相关操作，请检查"),

  CODE_10183(10183, "任务数据已不存在"),

  CODE_10184(10184, "资源操作标识已存在"),

  CODE_10185(10185, "对应资源类型不能为空"),

  CODE_10186(10186, "授权类型不能为空"),

  CODE_10187(10187, "资源类型ID已存在"),

  CODE_10188(10188, "资源类型ID不能为空"),

  CODE_10189(10189, "授权类型值不能为空"),

  CODE_10190(10190, "关联资源类型不能为空"),

  CODE_10191(10191, "资源操作标识不能为空"),

  CODE_10192(10192, "对象无此资源权限"),

  CODE_10193(10193, "请选择操作值"),

  CODE_10194(10194, "请选择权限"),

  CODE_10195(10195, "一个表单只能有一个主业务对象"),

  CODE_10196(10196, "业务扩展配置表达式处理异常"),

  CODE_10197(10197, "决策表不存在"),

  CODE_10198(10198, "流程任务实例获取参与人异常"),

  CODE_10199(10199, "任务认领出现异常"),

  CODE_10200(10200, "任务需要先认领"),

  CODE_10201(10201, "不存在相关的历史版本数据"),

  CODE_10202(10202, "流程定义差异过大不满足在途流程的迁移，请修改流程图"),

  CODE_10203(10203, "流程定义状态无需变更，请刷新重试"),

  CODE_10204(10204, "流程定义状态变更出现异常"),

  CODE_10205(10205, "修改流程定义bpmn出现异常"),

  CODE_10206(10206, "当前密码不匹配"),

  CODE_10207(10207, "配置表单决策表信息异常"),

  CODE_10301(10301, "语言名称或语言编码不能为空"),

  CODE_10302(10302, "语言编码已存在"),

  CODE_10303(10303, "语言编码不允许修改"),

  CODE_10401(10401, "授权代理参数异常");
  private final int code;
  private final String msg;

  ResultCode(int code, String msg) {
    this.code = code;
    this.msg = msg;
  }

}
